| Category            | Score | Notes |
|---------------------+-------+-------|
| Correctness  (65)   |    65 |       |
|---------------------+-------+-------|
| structure (20)      |    20 |       |
| Documentation  (15) |    15 |       |
|---------------------+-------+-------|
| Total               |   100 |       |
#+TBLFM: @>$2=vsum(@2..@-1)
* Notes 
